[
  {
    "color": "green",
    "list": [
      {
        "q": "What do I need in order to browse the SAFE Network?",
        "a": [
          {
            "cnt": "You need to download and install the SAFE Browser to connect to the network.",
            "type": "para"
          },
          {
            "cnt": "<b>To download:</b>",
            "type": "para"
          },
          {
            "cnt": "The latest version of the SAFE Browser is always available on GitHub here:<ul><li>https://github.com/maidsafe/safe_browser/releases/ </li></ul>",
            "type": "para"
          },
          {
            "cnt": "<b>To install:</b>",
            "type": "para"
          },
          {
            "cnt": "<ol><li>Open your downloads folder.</li><li>Extract the contents of the ZIP you downloaded in the first stage (generally just double-clicking on the file will do it).</li><li>Move the file to where you want to keep it (Perhaps your Desktop).</li><li>Double-click the SAFE Browser app to open it and start browsing!</li></ol>",
            "type": "para"
          }
        ]
      },
      {
        "q": "Do I need an account to access the network?",
        "a": [
          {
            "cnt": "It depends what you want to do.",
            "type": "para"
          },
          {
            "cnt": "<b>Browsing the SAFE Network’s websites:</b>",
            "type": "para"
          },
          {
            "cnt": "No account is required.  To view SAFE websites, all you need to do is to <a href='https://github.com/maidsafe/safe_browser/releases' target='_blank'>download the SAFE Browser</a> (currently available on Windows, Mac and Linux).",
            "type": "para"
          },
          {
            "cnt": "<b>Storing on the network:</b>",
            "type": "para"
          },
          {
            "cnt": "Yes, you’ll need an account to perform an action that requires storing any new data or modifying any existing data on the SAFE Network.  By 'storing' we mean activities like: <ul><li>hosting websites</li><li>file storage</li><li>email applications</li><li>instant messaging</li><li>etc.</li></ul>",
            "type": "para"
          }
        ]
      },
      {
        "q": "How do I create an account?",
        "a": [
          {
            "cnt": "Here’s a step-by-step Guide:",
            "type": "para"
          },
          {
            "cnt": "<ol><li><a href='https://github.com/maidsafe/safe_browser/releases' target='_blank'>Download</a> and Install the SAFE Browser.</li><li><a href='https://safenetforum.org/' target='_blank'>Register on the forum</a>, it takes less than a minute.</li><li>Gain basic trust level—this requires around an hour reading and interacting. This is a measure to stop the test network being spammed during development.</li><li>Open the SAFE browser.</li><li>Click ‘Create Account’ at the bottom of the screen.</li><li>In the next screen select ‘Claim An Invitation’.</li><li>Login to the forum within the SAFE Browser, the setup process will prompt you to do this if you have not already done so.</li><li>Select the Alpha 2 Network.</li><li>The installer will now provide you with your invitation code. Please note: it is important that your current and registered IPs match, if they do not, click to update.</li><li>Copy the invite code at the bottom of the screen and paste this back into the field that asks for an ‘Invitation Token’ in the SAFE Browser.</li><li>You will now be asked to create an Account Secret and Password. Please make sure you keep these safe as only you will ever have access to your credentials. There is no central record of these credentials anywhere within the system and without them you will not be able to access your data.</li><li>Congratulations! You are now ready to not just browse the SAFE Network, but upload your own data, create websites and use some of the demo apps being worked on by the community.</li></ol>",
            "type": "para"
          }
        ]
      },
      {
        "q": "How do I get involved with The SAFE Network community?",
        "a": [
          {
            "cnt": "The Community is most active on the [SAFE Network Forum](https://safenetforum.org/) and we’d suggest starting in the [beginners section](https://safenetforum.org/c/beginners )",
            "type": "para"
          },
          {
            "cnt": "Visit the Forum",
            "type": "anchor",
            "href": "https://safenetforum.org/"
          }
        ]
      },
      {
        "q": "How do I get help?",
        "a": [
          {
            "cnt": "The [SAFE Network Community](https://safenetforum.org) is the place to head to for all questions on the Network.",
            "type": "para"
          },
          {
            "cnt": "Visit the Forum",
            "type": "anchor",
            "href": "https://safenetforum.org/"
          }
        ]
      }

    ]
  }
]
